Revit 2024 API
ComboBoxData Class
This class contains information necessary to construct a combo box in the Ribbon.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ComboBoxData : RibbonItemData
Visual Basic
Public Class ComboBoxData _
	Inherits RibbonItemData
Visual C++
public ref class ComboBoxData : public RibbonItemData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ComboBoxData
See Also
ComboBoxData Members
Autodesk.Revit.UI Namespace